import pickle
import json


data = {
    'unsou_dic' : {'ﾄｰﾙ':'U0001', '新潟':'U0009', '名鉄':'U0002', 
                   '西濃':'U0003', 'ﾄﾅﾐ':'U0004', '福山':'U0006', 
                   '配達':'U0008', '佐川':'U0010', 'ｹｲﾋﾝ':'U0007', 
                   '久留米':'U0005', 'npNan': 'npNan', 
                   'NoData': 'NoData', 'NoCalc':'NoCalc'
    },
    
    'unsou_dic2' : {'ﾄｰﾙ':['トール','U0001'], '新潟':['新潟運輸','U0009'], 
                    '名鉄':['名鉄','U0002'], '西濃':['西濃','U0003'], 
                    'ﾄﾅﾐ':['トナミ','U0004'], '福山':['福山','U0006'], 
                    '配達':['配達','U0008'], '佐川':['佐川急便','U0010'], 
                    'ｹｲﾋﾝ':['ケイヒン','U0007'], '久留米':['久留米','U0005'],
                    'npNan':['npNan','npNan'], 'NoData':['NoData', 'NoData'],
                    'NoCalc':['NoCalc','NoCalc']
    },
    
    'haisou_kubun' : {'通常': 1, '土曜配達': 2, '営業所': 3, '曜日違い': 4,
                      '祝日配達': 5
    },

    'souko_dic' : {'土気出荷': 'S0021', '本社出荷': 'S0001', '大阪倉庫':'S0031'
    },

    'nonChange_list' : ['T1031', 'T1032', 'T1034', 'T1035', 'T1037', 'T1039'
    ]
}


json_str = json.dumps(data, ensure_ascii=False)
